[
    "You have to buy her a small gift!",
    "You owe her a fancy dinner!",
    "You have to write her a sweet love letter!",
    "You have to do her least favorite chore!",
    "You owe her a weekend getaway!",
    "You have to sing her favorite song in public!",
    "You owe her breakfast in bed!",
    "You have to plan a surprise date for her!",
    "You owe her control of the TV remote for a week!",
    "You have to take her shopping and say yes to everything she chooses!",
    "You have to cook her favorite meal from scratch!",
    "You owe her a day where she can choose all your outfits!",
    "You have to recreate your first date together!",
    "You owe her a handmade craft or card!",
    "You have to give her a day where she makes all the decisions!",
    "You owe her a romantic picnic at her favorite spot!",
    "You have to dance with her, no matter where you are!",
    "You owe her unlimited compliments for a day!",
    "You owe her a handwritten poem about her awesomeness!",
    "You have to wash her car by hand.",
    "You must let her pick the next three date nights.",
    "You owe her a playlist of songs that remind you of her.",
    "You must let her sleep in while you make breakfast.",
    "You owe her a day of saying 'yes' to everything she asks!",
    "You must clean the house top-to-bottom.",
    "You owe her a night of watching her favorite movies.",
    "You must do all the laundry for a week.",
    "You owe her a custom piece of art (even if you're bad at art!).",
    "You have to write her a love note for every day this week.",
    "You owe her a fancy coffee delivery to start her day.",
    "You must carry her purse all day without complaint.",
    "You owe her flowers just because.",
    "You owe her dessert from her favorite bakery.",
    "You must take her on a scenic walk or hike.",
    "You owe her an ice cream date with unlimited toppings.",
    "You must do all the dishes for a week.",
    "You owe her a photo shoot to make her feel special.",
    "You must write her name in the sand or snow.",
    "You owe her a day at the museum or zoo.",
    "You must surprise her with breakfast in bed tomorrow.",
    "You owe her a book from her favorite genre.",
    "You must clean out her car (and vacuum it too!).",
    "You owe her a day where she controls your phone wallpaper.",
    "You must plan and execute a surprise picnic.",
    "You owe her a day free of any teasing or joking!",
    "You must recreate her favorite childhood meal.",
    "You owe her an uninterrupted hour of compliments.",
    "You must let her pick your next hairstyle or outfit.",
    "You owe her a game night where she picks all the games.",
    "You must organize her closet or dresser.",
    "You owe her a heartfelt thank-you speech.",
    "You must serenade her with a song of her choice.",
    "You owe her a handwritten list of things you love about her.",
    "You must learn and perform a TikTok dance with her.",
    "You owe her a day where she picks every meal.",
    "You must craft a cheesy, romantic social media post about her.",
    "You owe her a video montage of your favorite memories.",
    "You must run her a bubble bath with candles and music.",
    "You owe her a handpicked bouquet of wildflowers.",
    "You must let her nap as long as she wants.",
    "You owe her a late-night drive with her favorite playlist.",
    "You must plan an elaborate scavenger hunt for her.",
    "You owe her an uninterrupted hour of deep conversation.",
    "You must take her to a bookstore and let her choose a book.",
    "You owe her a home-cooked candlelit dinner.",
    "You must wear matching outfits with her for a day.",
    "You owe her a random act of kindness in her honor.",
    "You must fold all the laundry and put it away.",
    "You owe her a framed picture of the two of you.",
    "You must bring her lunch at work or school.",
    "You owe her a surprise delivery of her favorite snack.",
    "You must spend the day binge-watching her favorite TV show.",
    "You owe her a heartfelt thank-you card.",
    "You must say something nice about her every hour today.",
    "You owe her a surprise phone call or text during the day.",
    "You must take her to her favorite childhood restaurant.",
    "You owe her a romantic walk under the stars.",
    "You must learn how to bake her favorite dessert.",
    "You owe her a shopping spree at her favorite store.",
    "You must organize and tidy up one room of her choice.",
    "You owe her a heartfelt apology for any recent mistakes.",
    "You must let her take over your favorite hobby for a day.",
    "You owe her a custom playlist of love songs.",
    "You must write her a fictional story where she's the hero.",
    "You owe her a quiet evening with no interruptions.",
    "You must plan a themed dinner night at home.",
    "You owe her a heartfelt video message just for her.",
    "You must do a karaoke performance of her favorite song.",
    "You owe her a cozy reading corner with snacks and drinks.",
    "You must give her a guided tour of a place you love.",
    "You owe her a long, handwritten letter about your favorite memories.",
    "You must let her redecorate a room with your help.",
    "You owe her a list of your favorite things about her.",
    "You must help her complete a task she's been putting off.",
    "You owe her a lazy morning with breakfast and coffee in bed.",
    "You must take her to a farmer's market or craft fair.",
    "You owe her a mini photo album of your favorite photos.",
    "You must plan a DIY project to do together.",
    "You owe her a night of stargazing.",
    "You must pack her lunch for a week.",
    "You owe her a date to try something new together.",
    "You must bake her cookies or a cake from scratch.",
    "You owe her a heartfelt toast at dinner.",
    "You must create a scrapbook of your relationship milestones.",
    "You owe her a dance in the living room.",
    "You must watch the sunset with her.",
    "You owe her a personalized coupon book with sweet gestures.",
    "You must leave her a surprise note where she'll find it.",
    "You owe her a day without using your phone around her.",
    "You must take her to a new restaurant she's been wanting to try.",
    "You owe her a playlist of songs that remind you of her.",
    "You must give her a “yes” day where you can’t say no."
]